<details><summary>Digger run report at 2024-01-28 14:16:16 (UTC)</summary>
  <details><summary>Apply for <b>ssmiller25/civo-digger#core-cluster</b></summary>
  
```terraform
Terraform will perform the following actions:

  # civo_firewall.core-firewall will be created
  + resource "civo_firewall" "core-firewall" {
      + create_default_rules = true
      + id                   = (known after apply)
      + name                 = "core"
      + network_id           = (known after apply)
      + region               = (known after apply)

      + ingress_rule {
          + action     = "allow"
          + cidr       = [
              + "0.0.0.0/8",
            ]
          + id         = (known after apply)
          + label      = "k8s"
          + port_range = "6443"
          + protocol   = "tcp"
        }
    }

  # civo_kubernetes_cluster.core-cluster will be created
  + resource "civo_kubernetes_cluster" "core-cluster" {
      + api_endpoint           = (known after apply)
      + cluster_type           = (known after apply)
      + cni                    = (known after apply)
      + created_at             = (known after apply)
      + dns_entry              = (known after apply)
      + firewall_id            = (known after apply)
      + id                     = (known after apply)
      + installed_applications = (known after apply)
      + kubeconfig             = (sensitive value)
      + kubernetes_version     = (known after apply)
      + master_ip              = (known after apply)
      + name                   = "core"
      + network_id             = (known after apply)
      + num_target_nodes       = (known after apply)
      + ready                  = (known after apply)
      + region                 = (known after apply)
      + status                 = (known after apply)
      + target_nodes_size      = (known after apply)

      + pools {
          + instance_names      = (known after apply)
          + label               = "front-end"
          + node_count          = 3
          + public_ip_node_pool = (known after apply)
          + size                = "g4s.kube.xsmall"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
civo_firewall.core-firewall: Creating...
civo_firewall.core-firewall: Creation complete after 6s [id=ad5f4d56-c640-4828-aa03-1bf79251eb0b]
civo_kubernetes_cluster.core-cluster: Creating...
civo_kubernetes_cluster.core-cluster: Still creating... [10s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [20s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [30s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [40s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [50s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [1m0s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [1m10s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [1m20s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [1m30s elapsed]
civo_kubernetes_cluster.core-cluster: Still creating... [1m40s elapsed]
civo_kubernetes_cluster.core-cluster: Creation complete after 1m49s [id=267e3cc4-1754-4471-a8d9-1f986bb2921e]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

  ```
</details>
</details>